<template lang="html">
    <header class="tours__header">
        <nav class="tours__header-nav">
            <div class="tours__header-nav-content container">
                <router-link class="nav__logo" to="/">
                    <svg width="175" height="36" viewBox="0 0 175 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M150.08 36.0003C143.953 36.0003 140.161 30.0346 139.108 24.113C139.007 23.4811 138.907 22.8346 138.834 22.1881C135.273 23.2314 131.626 23.2901 128.555 21.3065C128.343 21.1656 128.162 20.9837 128.019 20.7713C127.877 20.5588 127.778 20.3198 127.726 20.0681C127.675 19.8164 127.672 19.5567 127.719 19.3041C127.766 19.0514 127.861 18.8106 127.999 18.5954C128.138 18.3803 128.316 18.195 128.525 18.0501C128.733 17.9052 128.968 17.8036 129.215 17.7511C129.462 17.6986 129.716 17.6961 129.964 17.7439C130.212 17.7918 130.448 17.8889 130.66 18.0297C132.721 19.3962 135.72 19.1611 138.661 18.1179C138.751 13.9826 139.532 9.8932 140.968 6.02482C141.559 4.4085 142.67 1.36686 144.962 0.338293C145.458 0.119954 145.993 0.00732422 146.534 0.00732422C147.074 0.00732422 147.609 0.119954 148.105 0.338293C149.662 0.968971 150.99 2.07344 151.908 3.50122C152.827 4.929 153.291 6.61065 153.238 8.31707C152.892 12.8575 149.287 16.3546 146.317 18.4852C145.126 19.3308 143.873 20.0824 142.569 20.7334C142.63 21.6395 142.736 22.5418 142.886 23.4371C143.636 27.6101 146.202 32.0918 150.095 32.0918C150.577 32.1343 151.025 32.3594 151.352 32.7225C151.679 33.0857 151.86 33.5606 151.86 34.0534C151.86 34.5462 151.679 35.0211 151.352 35.3842C151.025 35.7474 150.577 35.9725 150.095 36.015L150.08 36.0003ZM146.534 3.9236C146 4.1587 145.351 5.39299 144.587 7.40605C143.543 10.2401 142.883 13.2063 142.626 16.2224C143.145 15.9138 143.65 15.5758 144.14 15.2379C146.015 13.886 149.201 11.153 149.432 7.97911C149.411 7.09856 149.133 6.24441 148.631 5.5268C148.13 4.80919 147.43 4.26102 146.62 3.95299L146.534 3.9236Z"
                            fill="#FEE6D3" />
                        <path
                            d="M128.338 35.9855C122.225 35.9855 118.433 30.0198 117.381 24.1128C117.265 23.481 117.179 22.8345 117.107 22.1879C113.545 23.2312 109.811 23.29 106.827 21.3063C106.403 21.0224 106.107 20.5793 106.004 20.0737C105.9 19.5682 105.997 19.0413 106.273 18.6083C106.549 18.1753 106.982 17.8713 107.478 17.7629C107.973 17.6544 108.491 17.7503 108.917 18.0296C110.993 19.3961 113.978 19.161 116.934 18.1177C117.019 13.9833 117.794 9.89385 119.226 6.02467C119.817 4.40834 120.927 1.36671 123.22 0.338139C123.726 0.109635 124.272 -0.00963707 124.826 -0.012166C125.379 -0.0146948 125.927 0.0995742 126.435 0.323445C127.992 0.954123 129.32 2.05859 130.238 3.48637C131.157 4.91415 131.621 6.59581 131.568 8.30222C131.222 12.8426 127.603 16.3398 124.647 18.4704C123.451 19.316 122.193 20.0676 120.884 20.7185C120.95 21.6249 121.061 22.5272 121.216 23.4222C121.749 26.361 123.941 32.0622 128.425 32.0622C128.691 32.0387 128.96 32.0719 129.214 32.1598C129.467 32.2477 129.7 32.3883 129.897 32.5727C130.095 32.7572 130.252 32.9814 130.36 33.2312C130.468 33.481 130.523 33.751 130.523 34.0239C130.523 34.2968 130.468 34.5667 130.36 34.8165C130.252 35.0663 130.095 35.2905 129.897 35.475C129.7 35.6594 129.467 35.8001 129.214 35.8879C128.96 35.9758 128.691 36.009 128.425 35.9855H128.338ZM124.806 3.92345C124.272 4.15855 123.609 5.39283 122.859 7.40589C121.801 10.2358 121.141 13.204 120.898 16.2222C121.418 15.9136 121.922 15.5757 122.34 15.2377C124.215 13.8859 127.401 11.1528 127.646 7.97896C127.639 7.11703 127.383 6.27626 126.912 5.56068C126.44 4.84509 125.773 4.28609 124.993 3.95283L124.806 3.92345Z"
                            fill="#FEE6D3" />
                        <path
                            d="M7.40554 32.4972L7.39666 32.4865C5.95252 30.748 5.22916 28.5062 5.37814 26.2353V14.7384H2.58597C2.02602 14.7384 1.5576 14.6098 1.22882 14.3067C0.896205 14 0.75 13.5552 0.75 13.019C0.75 12.4828 0.896205 12.038 1.22882 11.7313C1.5576 11.4282 2.02602 11.2996 2.58597 11.2996H5.37814V6.202C5.34285 5.91158 5.37264 5.61665 5.46544 5.33937C5.56002 5.05678 5.71757 4.79989 5.92615 4.58896C6.13474 4.37801 6.38874 4.21872 6.66845 4.12394C6.93742 4.03281 7.2229 4.00377 7.50414 4.03885C7.78223 4.00796 8.06368 4.04058 8.32792 4.13441C8.60287 4.23204 8.85142 4.39318 9.05422 4.60478C9.257 4.81637 9.40854 5.07265 9.49729 5.35332C9.58412 5.62792 9.60861 5.91881 9.56911 6.20417V11.2702H15.0863C15.6444 11.2702 16.1132 11.3943 16.4427 11.6958C16.7765 12.0013 16.9222 12.4471 16.9222 12.9896C16.9222 13.5322 16.7765 13.978 16.4427 14.2834C16.1132 14.5849 15.6444 14.709 15.0863 14.709H9.56911V25.9055V25.9139L9.56855 25.9223C9.47723 27.2791 9.83981 28.6267 10.5961 29.7453C11.0239 30.1968 11.5462 30.5434 12.1236 30.7594C12.7071 30.9776 13.3317 31.0567 13.9496 30.9908L13.9653 30.9892L13.9811 30.9895C14.4406 30.9987 14.8992 30.9431 15.3438 30.8241C15.7009 30.6987 16.0751 30.6306 16.4529 30.6224C16.6184 30.6036 16.7859 30.6271 16.9401 30.6907C17.0987 30.756 17.2377 30.8614 17.3442 30.9964L17.3524 31.0067L17.3594 31.0178C17.5959 31.3922 17.7054 31.8346 17.672 32.2775C17.6719 32.6558 17.5967 33.0304 17.4506 33.3786L17.4486 33.3836L17.4485 33.3835C17.3671 33.5664 17.2493 33.7304 17.1021 33.865C16.955 33.9997 16.7817 34.102 16.5933 34.1654L16.5866 34.1676L16.5865 34.1675C16.1037 34.3147 15.6133 34.4347 15.1175 34.5268M7.40554 32.4972L15.0718 34.2811M7.40554 32.4972L7.41556 32.5069C8.21991 33.2814 9.17467 33.8761 10.2186 34.2525C11.26 34.628 12.367 34.7779 13.4686 34.6925M7.40554 32.4972L13.457 34.4427M15.1175 34.5268L15.0718 34.2811M15.1175 34.5268C15.1177 34.5268 15.1178 34.5268 15.1179 34.5268L15.0718 34.2811M15.1175 34.5268C14.5734 34.6289 14.0218 34.6843 13.4686 34.6925M15.0718 34.2811C14.539 34.381 13.9988 34.4351 13.457 34.4427M13.4686 34.6925C13.4713 34.6923 13.4739 34.6921 13.4766 34.6919L13.457 34.4427M13.4686 34.6925C13.4659 34.6926 13.4632 34.6926 13.4606 34.6927L13.457 34.4427"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                        <path
                            d="M24.3183 14.5055V13.1101C24.3573 12.8263 24.333 12.537 24.247 12.2638C24.1592 11.9846 24.0092 11.7294 23.8084 11.5181C23.6075 11.3069 23.3612 11.1454 23.0885 11.0465C22.8204 10.9493 22.5342 10.9153 22.2514 10.9469C21.6239 10.9496 21.1089 11.1201 20.7535 11.5C20.3982 11.8797 20.2427 12.426 20.2427 13.0924V32.3818C20.2009 32.6739 20.2247 32.972 20.3125 33.2536C20.4023 33.5416 20.5565 33.8047 20.7635 34.0222C20.9705 34.2397 21.2246 34.4056 21.506 34.5064C21.7758 34.6032 22.0634 34.6374 22.3478 34.6067C22.6391 34.6493 22.9362 34.6234 23.2163 34.5307C23.5079 34.4343 23.7723 34.2684 23.9876 34.0473C24.2029 33.8262 24.363 33.5563 24.4549 33.2603C24.5447 32.971 24.5669 32.6647 24.5202 32.3654V21.1741H24.5205L24.5198 21.1608C24.4759 20.3306 24.593 19.4998 24.8645 18.716C25.1347 17.9356 25.5526 17.2171 26.0942 16.6014C27.3473 15.4086 28.982 14.7208 30.6943 14.6647L30.7054 14.6644L30.7165 14.663L31.4346 14.5752C32.0608 14.5125 32.5641 14.3097 32.8954 13.9434C33.2308 13.5725 33.3546 13.0734 33.2995 12.4956C33.2465 11.9403 33.0916 11.4816 32.7783 11.1759C32.4592 10.8646 32.0202 10.7542 31.4956 10.8001C29.86 10.817 28.2551 11.2527 26.8284 12.0669C25.7956 12.6512 24.9336 13.493 24.3183 14.5055Z"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                        <path
                            d="M36.3335 31.2029L36.3342 31.2038C37.0882 32.3084 38.1171 33.1896 39.3158 33.7568C40.6168 34.3943 42.0457 34.7147 43.4896 34.6925C45.0154 34.722 46.5174 34.3058 47.818 33.4937L47.8195 33.4928C48.7499 32.9033 49.5296 32.1056 50.1029 31.1662V32.4C50.1029 33.0868 50.2792 33.6448 50.6404 34.0325C51.004 34.4228 51.5212 34.6043 52.1263 34.6043C52.7324 34.6043 53.2294 34.4219 53.569 34.0245C53.9023 33.6344 54.0488 33.0773 54.0488 32.4V19.8615C54.2456 17.4016 53.4852 14.9606 51.9303 13.0659L51.9179 13.0508L51.9032 13.0378C51.0063 12.2396 49.9609 11.6328 48.8291 11.2534C47.7003 10.8751 46.5084 10.7309 45.3239 10.8293C44.045 10.8423 42.7717 11.0023 41.5281 11.3064C40.1468 11.6368 38.8096 12.1356 37.5455 12.7918C37.3118 12.8886 37.1012 13.0347 36.9277 13.2203C36.7513 13.4089 36.6173 13.6337 36.5344 13.8793L36.5344 13.8793L36.534 13.8805C36.3877 14.3216 36.3874 14.7992 36.5332 15.2404C36.5999 15.455 36.7096 15.6536 36.8557 15.8233C37.0024 15.9938 37.1827 16.1315 37.3851 16.2275L37.395 16.2323L37.4053 16.2361C37.6563 16.3291 37.9255 16.3605 38.1909 16.3274C38.4522 16.2949 38.702 16.2009 38.9208 16.0533C39.9563 15.4814 41.0569 15.042 42.1978 14.7448L42.1989 14.7445C43.2238 14.4727 44.2779 14.3324 45.3368 14.3268L45.3477 14.3267L45.3586 14.3257C45.9941 14.2669 46.6347 14.3443 47.2394 14.5529C47.8369 14.759 48.3865 15.0889 48.8534 15.5221C49.6848 16.656 50.0744 18.0649 49.9454 19.4761L49.9443 19.4874V19.4988V20.7182H48.7554C46.1033 20.6592 43.452 20.867 40.84 21.3386C39.2325 21.5754 37.7387 22.3187 36.5677 23.4637L36.557 23.4742L36.5477 23.4858C35.6308 24.6252 35.1643 26.0712 35.238 27.5413C35.2236 28.8472 35.606 30.1263 36.3335 31.2029ZM44.0912 31.3715L44.0804 31.371L44.0697 31.3715C42.8609 31.4273 41.6748 31.0204 40.7443 30.2299C40.3533 29.8621 40.0437 29.413 39.8366 28.9126C39.6287 28.4103 39.529 27.8682 39.5443 27.323L39.5446 27.3122L39.544 27.3015C39.521 26.9055 39.5776 26.509 39.7101 26.1363C39.8408 25.769 40.0425 25.4326 40.3029 25.147C41.1057 24.4908 42.0824 24.0947 43.1071 24.0092L43.1072 24.0095L43.1193 24.0078C45.019 23.7549 46.9341 23.6427 48.8496 23.672L48.8496 23.6721H48.8535H50.0453V24.8033H50.0451L50.0454 24.8123C50.1075 26.5439 49.5151 28.2331 48.3917 29.5314C47.8499 30.14 47.1842 30.6199 46.4416 30.9376C45.6985 31.2556 44.8962 31.4037 44.0912 31.3715Z"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                        <path
                            d="M68.6171 34.6045V34.6045L68.6211 34.6045C69.2074 34.6032 69.7769 34.4079 70.244 34.0487C70.7066 33.6929 71.0437 33.1957 71.2067 32.631L79.2303 13.8837C79.3724 13.5685 79.4458 13.2259 79.4458 12.8794C79.4458 12.532 79.372 12.1886 79.2292 11.8728L79.2295 11.8727L79.2239 11.8616C79.0661 11.5542 78.8202 11.3018 78.5179 11.1385C78.2226 10.9791 77.8875 10.9121 77.5548 10.946C77.0905 10.9163 76.63 11.0467 76.2478 11.3159L76.2348 11.325L76.2231 11.3358C75.854 11.6733 75.5779 12.1025 75.4214 12.5809L68.765 29.1005L62.125 12.5872C61.9994 12.1235 61.7297 11.7126 61.355 11.4166C60.98 11.1203 60.5203 10.9554 60.0449 10.9472C59.6838 10.9032 59.3179 10.9627 58.9884 11.1188C58.6545 11.277 58.3719 11.5279 58.1728 11.8419L58.1657 11.8531L58.1598 11.865C58.0007 12.1867 57.918 12.5417 57.918 12.9015C57.918 13.2587 57.9995 13.6111 58.1563 13.9309L66.0206 32.6322C66.1925 33.1942 66.534 33.6877 66.9976 34.042C67.4649 34.3992 68.0319 34.5964 68.6171 34.6045Z"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                        <path
                            d="M84.9723 31.4825L84.972 31.4827L84.9816 31.492C86.1009 32.584 87.4279 33.4314 88.8809 33.9819C90.3327 34.5318 91.8795 34.7738 93.4264 34.6928C94.8105 34.6678 96.1844 34.4471 97.5087 34.0368C98.8103 33.6982 100.042 33.1267 101.147 32.3491C101.447 32.1874 101.699 31.9498 101.882 31.6598C102.067 31.3653 102.172 31.0267 102.188 30.6781L102.189 30.6781L102.189 30.6675C102.19 30.3655 102.113 30.0682 101.965 29.8057C101.817 29.5433 101.603 29.3247 101.344 29.1727L101.337 29.1685L101.33 29.1648C101.006 29.0018 100.641 28.939 100.282 28.9844C99.9258 29.0293 99.5909 29.1784 99.3174 29.4128C98.4368 30.0573 97.4522 30.5393 96.4084 30.8368C95.4306 31.0911 94.4258 31.2214 93.4168 31.2247L93.4168 31.2243L93.4029 31.2251C92.4289 31.2825 91.4535 31.1399 90.5344 30.8057C89.6186 30.4727 88.7772 29.9562 88.0598 29.2864C86.7201 27.795 85.9709 25.8522 85.9526 23.8341H100.742C101.304 23.8341 101.772 23.701 102.1 23.3962C102.43 23.0897 102.577 22.6484 102.578 22.1217C102.741 19.1432 101.818 16.2076 99.9868 13.8785L99.9817 13.872L99.9761 13.8658C99.0612 12.8496 97.9371 12.0517 96.6838 11.5293C95.4335 11.0081 94.0856 10.7741 92.7362 10.8442C90.7528 10.8009 88.7971 11.3223 87.0891 12.3494L87.0891 12.3494L87.0872 12.3506C85.442 13.3599 84.1105 14.8216 83.2453 16.5669L83.2449 16.5678C82.2933 18.5056 81.8194 20.6502 81.8638 22.8161C81.7815 24.3977 82.0138 25.9801 82.5468 27.4682C83.0809 28.9591 83.9059 30.3247 84.9723 31.4825ZM92.8142 14.1211L92.8272 14.1218L92.8401 14.1211C93.6554 14.0766 94.4704 14.2174 95.2261 14.5332C95.9791 14.8479 96.6547 15.3287 97.2044 15.9414C98.2815 17.3458 98.8738 19.0716 98.8926 20.8508H86.0166C86.1774 19.0663 86.8947 17.379 88.066 16.0381C88.6782 15.3931 89.4179 14.8886 90.2357 14.5581C91.055 14.227 91.9341 14.0781 92.8142 14.1211Z"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                        <path
                            d="M156.535 31.2032L156.535 31.2042C157.289 32.3088 158.318 33.19 159.517 33.7571C160.818 34.3946 162.247 34.715 163.691 34.6929C165.221 34.7252 166.729 34.309 168.034 33.4941L168.035 33.4932C168.965 32.9036 169.745 32.106 170.319 31.1666V32.4004C170.319 33.0872 170.495 33.6452 170.856 34.0329C171.22 34.4231 171.737 34.6047 172.342 34.6047C172.948 34.6047 173.445 34.4223 173.785 34.0248C174.118 33.6347 174.264 33.0777 174.264 32.4004V19.8617C174.457 17.3996 173.691 14.9583 172.131 13.0659L172.119 13.0509L172.104 13.0381C171.209 12.2418 170.166 11.6361 169.037 11.2568C167.911 10.8785 166.722 10.7333 165.54 10.8297C164.261 10.8435 162.988 11.0035 161.744 11.3068C160.366 11.6349 159.034 12.1338 157.775 12.7921C157.541 12.8886 157.329 13.034 157.153 13.2188C156.974 13.4067 156.837 13.631 156.751 13.8766L156.751 13.8766L156.75 13.8809C156.603 14.3215 156.603 14.7987 156.748 15.2395C156.82 15.4792 156.948 15.6982 157.12 15.8782L157.301 15.7052L157.12 15.8782C157.294 16.0591 157.508 16.1951 157.744 16.2744C157.981 16.3537 158.233 16.3737 158.479 16.3327C158.719 16.2927 158.946 16.196 159.142 16.0508C160.176 15.4804 161.274 15.0419 162.413 14.7452L162.414 14.7449C163.439 14.4731 164.493 14.3327 165.552 14.3271L165.563 14.3271L165.574 14.3261C166.21 14.2673 166.85 14.3446 167.455 14.5532C168.053 14.7594 168.602 15.0893 169.069 15.5225C169.9 16.6563 170.29 18.0653 170.161 19.4764L170.16 19.4878V19.4992V20.7186H168.971C166.314 20.659 163.658 20.8668 161.041 21.339C159.434 21.5757 157.94 22.3191 156.769 23.4641L156.758 23.4745L156.749 23.4861C155.832 24.6256 155.365 26.0716 155.439 27.5416C155.425 28.8476 155.807 30.1267 156.535 31.2032ZM164.29 31.3718L164.279 31.3714L164.268 31.372C163.049 31.4419 161.85 31.0337 160.916 30.23C160.52 29.8652 160.206 29.4168 159.997 28.9156C159.786 28.4132 159.686 27.87 159.702 27.3238L159.703 27.3128L159.702 27.3018C159.679 26.9059 159.735 26.5094 159.868 26.1367C159.999 25.7694 160.2 25.433 160.461 25.1474C161.264 24.4911 162.24 24.095 163.265 24.0095L163.265 24.0098L163.277 24.0082C165.177 23.7562 167.092 23.644 169.008 23.6724V23.6724H169.011H170.203V24.8037H170.203L170.203 24.8126C170.265 26.5443 169.673 28.2334 168.55 29.5318C168.012 30.1348 167.353 30.6114 166.618 30.9289C165.883 31.2467 165.089 31.3978 164.29 31.3718Z"
                            fill="#FEE6D3" stroke="#FEE6D3" stroke-width="0.5" />
                    </svg>
                </router-link>
                <ul class="tours__header-nav-list" role="list">
                    <li v-for="(item, index) in links" :key="index">
                        <router-link class="tours__header-nav-list-link" :to="item.path">
                            {{ $t(`navLinks.${item.name}`) }}
                        </router-link>
                    </li>
                </ul>
                <div class=" tours__header-nav-options">
                    <LangBtn :lang="lang" :toggleLanguageDialog="toggleLanguageDialog" />
                    <PrimaryBtn :reversed="true" :btnText="'Войти'"
                        :btn-action="() => loginStore.toggleModalStatus(true)" />
                </div>
                <div class="tours__header-nav-btn" @click="toggleShowAdaptiveNav(true)">
                    <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M3.5 7.875C3.5 7.39175 3.89175 7 4.375 7H23.625C24.1082 7 24.5 7.39175 24.5 7.875C24.5 8.35825 24.1082 8.75 23.625 8.75H4.375C3.89175 8.75 3.5 8.35825 3.5 7.875ZM3.5 14C3.5 13.5168 3.89175 13.125 4.375 13.125H23.625C24.1082 13.125 24.5 13.5168 24.5 14C24.5 14.4832 24.1082 14.875 23.625 14.875H4.375C3.89175 14.875 3.5 14.4832 3.5 14ZM3.5 20.125C3.5 19.6418 3.89175 19.25 4.375 19.25H23.625C24.1082 19.25 24.5 19.6418 24.5 20.125C24.5 20.6082 24.1082 21 23.625 21H4.375C3.89175 21 3.5 20.6082 3.5 20.125Z"
                            fill="white" />
                    </svg>
                </div>
            </div>
        </nav>
        <AdaptiveMainNavBar :toggleShowAdaptiveNav="toggleShowAdaptiveNav" :showAdaptiveNav="showAdaptiveNav" />
        <LanguagePicker :setLang="setLang" :toggleLanguageDialog="toggleLanguageDialog"
            :showModal="showLanguageDialog" />
    </header>

    <main class="main">
        <section class="main__detail">
            <div class="main__detail-header container">
                <div class="main__detail-header-options">
                    <div class="main__detail-header-options-item">
                        <svg width="15" height="14" viewBox="0 0 15 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M10.9411 1.6828C11.0749 1.94005 10.9748 2.25703 10.7175 2.3908L10.3002 2.60781V11.9C10.3002 12.2866 9.98679 12.6 9.6002 12.6H8.0182C7.72825 12.6 7.4932 12.365 7.4932 12.075V9.62501C7.4932 9.33506 7.25815 9.10001 6.9682 9.10001H5.2252C4.93525 9.10001 4.7002 9.33506 4.7002 9.62501V12.075C4.7002 12.365 4.46514 12.6 4.1752 12.6H1.7252C1.43525 12.6 1.2002 12.365 1.2002 12.075C1.2002 11.7851 1.43525 11.55 1.7252 11.55H1.9002V6.97009C1.65727 7.05625 1.38182 6.95242 1.25951 6.71722C1.12575 6.45997 1.22585 6.14299 1.48309 6.00922L1.9002 5.79233V4.02501C1.9002 3.73506 2.13525 3.50001 2.4252 3.50001C2.71514 3.50001 2.9502 3.73506 2.9502 4.02501V5.24633L10.2331 1.45922C10.4903 1.32545 10.8073 1.42555 10.9411 1.6828Z"
                                fill="#24292E" />
                            <path
                                d="M11.6032 5.99847C11.76 5.90328 11.9551 5.89684 12.1179 5.98146L13.5174 6.70923C13.7747 6.84299 13.8748 7.15998 13.741 7.41722C13.6187 7.65238 13.3433 7.75622 13.1004 7.67014V11.55H13.2752C13.5651 11.55 13.8002 11.7851 13.8002 12.075C13.8002 12.365 13.5651 12.6 13.2752 12.6H11.8752C11.7359 12.6 11.6024 12.5447 11.5039 12.4462C11.4055 12.3478 11.3502 12.2142 11.3502 12.075L11.3506 6.44721C11.3507 6.26378 11.4464 6.09366 11.6032 5.99847Z"
                                fill="#24292E" />
                        </svg>
                        <span>{{ hotelDetail?.country }}</span>
                    </div>
                    <div class="main__detail-header-options-item">
                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M7.10719 1.01859C6.88242 0.478179 6.11687 0.478179 5.8921 1.01859L4.61054 4.09983L1.28408 4.36651C0.700665 4.41328 0.464096 5.14136 0.9086 5.52213L3.44301 7.69312L2.6687 10.9392C2.5329 11.5085 3.15224 11.9585 3.65173 11.6534L6.49964 9.91389L9.34755 11.6534C9.84704 11.9585 10.4664 11.5085 10.3306 10.9392L9.55627 7.69312L12.0907 5.52213C12.5352 5.14136 12.2986 4.41328 11.7152 4.36651L8.38874 4.09983L7.10719 1.01859Z"
                                fill="#C8811A" />
                        </svg>
                        <span>{{ hotelDetail?.stars }}</span>
                    </div>
                    <div class="main__detail-header-options-item">
                        <svg width="13" height="12" viewBox="0 0 13 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M4.71902 0.402751C4.88002 0.53134 4.95091 0.742219 4.90029 0.941951C4.80249 1.32781 4.75039 1.73243 4.75039 2.14996C4.75039 4.85615 6.9442 7.04996 9.65039 7.04996C10.4509 7.04996 11.2051 6.85842 11.8711 6.51914C12.0547 6.42562 12.276 6.44814 12.437 6.57673C12.598 6.70532 12.6689 6.9162 12.6183 7.11593C11.9652 9.69283 9.63117 11.6 6.85039 11.6C3.5643 11.6 0.900391 8.93605 0.900391 5.64996C0.900391 3.33396 2.22373 1.32796 4.15309 0.345164C4.33669 0.25164 4.55802 0.274162 4.71902 0.402751Z"
                                fill="#281AC8" />
                        </svg>
                        <span>{{ hotelDetail?.nights }} Ночь</span>
                    </div>
                </div>
            </div>
            <div class="main__detail-content container">
                <div class="main__detail-content-item">
                    <h1 class="main__detail-content-item-title">
                        {{ hotelDetail?.name }}
                    </h1>
                    <p class="main__detail-content-item-location">
                        <svg width="15" height="17" viewBox="0 0 15 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M7.19008 16.933L7.19288 16.9342C7.39 17.02 7.5 17 7.5 17C7.5 17 7.61 17.02 7.80791 16.9339L7.80992 16.933L7.81565 16.9304L7.83381 16.922C7.84884 16.915 7.86967 16.9052 7.89591 16.8926C7.94837 16.8673 8.02255 16.8306 8.11533 16.7822C8.30078 16.6855 8.56121 16.5419 8.87166 16.3495C9.49123 15.9655 10.3174 15.3826 11.1455 14.5844C12.8022 12.9876 14.5 10.4925 14.5 7C14.5 3.13401 11.366 0 7.5 0C3.63401 0 0.5 3.13401 0.5 7C0.5 10.4925 2.19783 12.9876 3.85452 14.5844C4.68264 15.3826 5.50877 15.9655 6.12834 16.3495C6.43879 16.5419 6.69922 16.6855 6.88467 16.7822C6.97745 16.8306 7.05163 16.8673 7.10409 16.8926C7.13033 16.9052 7.15116 16.915 7.16619 16.922L7.18435 16.9304L7.19008 16.933ZM7.5 9.25C8.74264 9.25 9.75 8.24264 9.75 7C9.75 5.75736 8.74264 4.75 7.5 4.75C6.25736 4.75 5.25 5.75736 5.25 7C5.25 8.24264 6.25736 9.25 7.5 9.25Z"
                                fill="#FF5722" />
                        </svg>
                        {{ hotelDetail?.address }}
                    </p>
                    <p class="main__detail-content-item-overview">
                        <span>Описание</span>
                        {{ hotelDetail?.full_description }}
                    </p>
                    <div class="main__detail-content-item-options">
                        <span v-show="hotelDetail?.has_wifi">WI-FI</span>
                        <span v-show="hotelDetail?.beach_line">{{ hotelDetail?.beach_line }}</span>
                        <span v-show="hotelDetail?.beach_type">{{ hotelDetail?.beach_type }}</span>
                    </div>

                    <div class="main__detail-content-item-price">
                        <div class="main__detail-content-item-price-block">
                            <span>Средняя цена (цена зависит от номера)</span>
                            <p v-show="hotelDetail?.rooms && hotelDetail?.rooms?.length > 0"> <span>от</span> {{
                                hotelDetail?.rooms[0]?.price
                                }}</p>

                        </div>
                        <PrimaryBtn class="main__detail-content-item-price-booking" :reversed="false"
                            :btnText="'Забронировать'" :btn-action="() => { }" />
                    </div>

                </div>
                <div class="main__detail-content-item" style="overflow: hidden;">
                    <img v-show="hotelDetail?.hotel_gallery" :src="hotelDetail?.hotel_gallery[galleryActiveImage].photo"
                        :alt="hotelDetail?.hotel_gallery[0].photo" class="main__detail-content-item-preview">

                    <div class="main__detail-content-item-gallery">
                        <swiper :slidesPerView="4" :spaceBetween="30" :freeMode="true" style="margin-top: 40px;">
                            <swiper-slide class="main__info-detail-gallery-item-swiper-item"
                                v-for="(photo, index) in hotelDetail?.hotel_gallery" :key="photo.id">
                                <img :src="photo?.photo" :alt="photo?.photo" width="98px" height="98px"
                                    @click="setGalleryActiveImage(index)">
                            </swiper-slide>

                        </swiper>
                    </div>

                </div>
            </div>
        </section>

        <section class="main__rooms container">
            <h2 class="main__rooms-title">
                Выберите номер
            </h2>
            <div class="main__rooms-item" v-for="item in hotelDetail?.rooms" :key="item.id" v-show="hotelDetail?.rooms">
                <div class="main__rooms-item-gallery">
                    <img :src="item.room_images[0].image" :t="item.room_images[0].image"
                        class="main__rooms-item-gallery-preview">
                    <div class="main__rooms-item-gallery-items">
                        <swiper :slidesPerView="item.room_images.length / 1.1" :spaceBetween="30" :freeMode="true"
                            style="margin-top: 40px;">
                            <swiper-slide class="main__info-detail-gallery-item-swiper-item"
                                v-for="(photo) in item.room_images" :key="photo.id">
                                <img :src="photo?.image" :alt="photo?.image">
                            </swiper-slide>
                        </swiper>
                    </div>
                </div>
                <div class="main__rooms-item-text">
                    <h4 class="main__rooms-item-text-title">
                        {{ item?.name }}
                    </h4>
                    <p v-show="item.is_all_inclusive">
                        <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M7.99281 19C7.56823 19 7.17296 18.7635 7.01759 18.3684C6.68349 17.5187 6.5 16.5933 6.5 15.625C6.5 13.8759 7.09874 12.2667 8.10244 10.991C8.25335 10.7993 8.47456 10.6821 8.70214 10.594C9.17496 10.4109 9.59254 10.0797 9.9141 9.66967C10.6873 8.68384 11.6617 7.8634 12.7755 7.27021C13.4977 6.88563 14.1243 6.31428 14.4281 5.55464C14.6408 5.0231 14.75 4.45587 14.75 3.88338V3.25C14.75 2.83579 15.0858 2.5 15.5 2.5C16.7426 2.5 17.75 3.50736 17.75 4.75C17.75 5.90163 17.4904 6.99263 17.0266 7.96771C16.761 8.52604 17.1336 9.25 17.7519 9.25H20.8777C21.9044 9.25 22.8233 9.94399 22.932 10.9649C22.9769 11.3871 23 11.8158 23 12.25C23 15.0976 22.0081 17.7136 20.351 19.7712C19.9634 20.2525 19.3642 20.5 18.7462 20.5H14.7302C14.2466 20.5 13.7661 20.422 13.3072 20.2691L10.1928 19.2309C9.73393 19.078 9.25342 19 8.76975 19H7.99281Z"
                                fill="#FF5722" />
                            <path
                                d="M2.83149 11.2271C2.29481 12.5889 2 14.0725 2 15.625C2 16.8451 2.18208 18.0226 2.52056 19.132C2.77991 19.982 3.60418 20.5 4.49289 20.5H5.40067C5.8462 20.5 6.12137 20.0017 5.92423 19.6022C5.33248 18.4029 5 17.0528 5 15.625C5 13.9168 5.47588 12.3198 6.3023 10.9593C6.5473 10.5559 6.27404 10 5.80212 10H4.74936C3.91733 10 3.13655 10.453 2.83149 11.2271Z"
                                fill="#FF5722" />
                        </svg>
                        <span>Все включено</span>
                    </p>

                    <div class="main__rooms-item-text-price">
                        <p> {{ item?.price }} <span>сум</span></p>
                        <PrimaryBtn class="main__detail-content-item-price-booking" :reversed="false"
                            :btnText="'Выбрать этот номер'" :btn-action="() => { }" />
                    </div>
                    <p class="main__rooms-item-text-inclusive">
                        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                d="M10.1611 2.73657C10.3571 2.57381 10.6429 2.57381 10.8389 2.73657C12.7777 4.34642 15.2315 5.35747 17.9166 5.48601C18.158 5.49756 18.3641 5.67189 18.3957 5.91143C18.4645 6.43129 18.5 6.96164 18.5 7.50028C18.5 12.6627 15.2401 17.0637 10.6665 18.7572C10.5593 18.7969 10.441 18.7969 10.3338 18.7572C5.76004 17.0638 2.5 12.6627 2.5 7.50016C2.5 6.96156 2.53548 6.43125 2.60424 5.91144C2.63593 5.67189 2.84202 5.49756 3.08337 5.48601C5.7685 5.35748 8.22231 4.34643 10.1611 2.73657ZM14.3566 8.69113C14.6002 8.35614 14.5261 7.88708 14.1911 7.64345C13.8561 7.39982 13.3871 7.47388 13.1434 7.80887L9.65969 12.599L7.78033 10.7197C7.48744 10.4268 7.01256 10.4268 6.71967 10.7197C6.42678 11.0126 6.42678 11.4874 6.71967 11.7803L9.21967 14.2803C9.37477 14.4354 9.58999 14.5149 9.80867 14.4977C10.0273 14.4805 10.2275 14.3685 10.3566 14.1911L14.3566 8.69113Z"
                                fill="#FF5722" />
                        </svg>
                        <span>Удобства в номере</span>
                    </p>
                    <p class="main__rooms-item-text-descr">
                        {{ item?.description }}
                    </p>

                </div>
            </div>

        </section>

        <section class="main__location container">
            <h2 class="main__location-title">
                Расположение отеля
            </h2>
            <span>{{ hotelDetail?.address }}</span>

            <MapsBlock
                :coordinates="[Number(hotelDetail?.coordinates.split(',')[0]), Number(hotelDetail?.coordinates.split(',')[1])]"
                style="margin-top: 20px; border-radius:20px;" />

        </section>
        <section class="main__reviews">
            <SectionHeader title="Что о нас говорят" titleSpan="путешественники" top="Отзывы о компании" descr=""
                data-aos="fade-left" />
            <ReviewBloc />
        </section>
        <CorporativeBloc />

    </main>


    <Footer />
</template>


<script lang="ts" setup>

import { ref, onMounted, type Ref, computed } from 'vue';

import Footer from '../../components/Footer/Footer.vue';
import MapsBlock from '../../components/MapsBlock/MapsBlock.vue';
import LanguagePicker from '../../components/LanguagePicker/LanguagePicker.vue';
import AdaptiveMainNavBar from '../../components/MainNavBar/AdaptiveMainNavBar.vue';
import LangBtn from '../../components/LangBtn/LangBtn.vue';
import PrimaryBtn from '../../components/PrimaryBtn/PrimaryBtn.vue';
import CorporativeBloc from '../../components/CorporativeBloc/CorporativeBloc.vue';
import SectionHeader from '../../components/SectionHeader/SectionHeader.vue';
import ReviewBloc from '../../components/ReviewsBloc/ReviewBloc.vue';

import { useLoginStore } from '../../stores/loginStore';
import { useHotelStore } from '../../stores/hotelsStore';

import router from '../../router/router';

import { type HotelDetail } from '../../../types/hotels';

import i18n from '../../i18n';

import { Swiper, SwiperSlide } from 'swiper/vue';
import 'swiper/css';
import 'swiper/css/free-mode';


const loginStore = useLoginStore();
const hotelStore = useHotelStore();
const galleryActiveImage = ref<number>(0);

const setGalleryActiveImage = (index: number) => {
    galleryActiveImage.value = index;
}

const showAdaptiveNav: Ref<boolean> = ref(false);
const showLanguageDialog = ref(false);
const toggleShowAdaptiveNav: Function = (value: boolean): void => {
    showAdaptiveNav.value = value;
    if (showAdaptiveNav.value) {
        document.body.style.overflow = 'hidden';
    } else {
        document.body.style.overflow = 'scroll';
    }
}

onMounted(() => {
    const slug = router.currentRoute.value.params.slug as string;
    hotelStore.fetchHotelDetail(slug);
});


const hotelDetail = computed<HotelDetail | null>(() => hotelStore.hotelDetail);


let lang = localStorage.lang;
const setLang = (langData: string) => {
    localStorage.lang = langData;
    lang = langData;
    i18n.global.locale = lang;
    toggleLanguageDialog(false);
}
const toggleLanguageDialog = (value: boolean): void => {
    showLanguageDialog.value = value;
    if (showLanguageDialog.value) {
        document.body.style.overflow = 'hidden';
    } else {
        document.body.style.overflow = 'scroll';
    }
}

const links = [
    { name: 'tours', path: '/tours' },
    { name: 'about', path: '/about' },
    { name: 'corporative', path: '/corporative' },
    { name: 'contacts', path: '/contacts' },
];

</script>



<style lang="scss" scoped>
.tours__header {
    z-index: 10;

    &-nav {
        padding: 40px 0;
        background: var(--primary-500);
        margin: -8px;
        border-radius: 0 0 40px 40px;

        &-content {
            display: flex;
            justify-content: space-between;
            align-items: center;
        }

        &-list {
            display: flex;
            gap: 28px;

            &-link {
                font-weight: 400;
                font-size: 18px;
                line-height: 125%;
                color: var(--white);
                cursor: pointer;
                transition: .5s linear;

                &.page {
                    color: var(--gray-900);
                }

                @media (max-width:1200px) {
                    font-size: 16px;
                }
            }

            @media (max-width:992px) {
                display: none;
            }
        }

        &-options {
            display: flex;
            gap: 16px;

            @media (max-width:992px) {
                display: none;
            }
        }

        &-btn {
            width: 56px;
            height: 56px;
            border-radius: 50%;
            background: var(--primary-500);
            justify-content: center;
            align-items: center;
            visibility: hidden;
            display: none;
            opacity: 0;

            @media (max-width:992px) {
                display: flex;
                visibility: visible;
                opacity: 1;
            }
        }
    }
}

.loader__main {
    height: 100vh;
    background: var(--white);
    overflow: hidden;
    border-radius: 50px;
    margin: 40px 0;
}

.main {
    display: flex;
    flex-direction: column;
    padding: 40px 0;

    & img {
        user-select: none;
    }

    &__location {
        margin-top: 40px;

        & span {
            margin-top: 10px;
            font-weight: 700;
            font-size: 20px;
            color: var(--gray-900);
        }

        &-title {
            font-weight: 700;
            font-size: 36px;
            color: var(--gray-900);
        }
    }

    &__rooms {
        padding-top: 40px;
        display: flex;
        flex-direction: column;
        gap: 20px;

        &-title {
            font-weight: 700;
            font-size: 36px;
            color: var(--gray-900);
        }

        &-item {
            display: flex;
            gap: 20px;
            padding: 16px;
            background: var(--white);
            border-radius: 40px;


            &-gallery {
                max-width: 300px;
                width: 100%;


                &-preview {
                    width: 300px;
                    height: 200px;
                    object-fit: cover;
                    border-radius: 40px;
                }

                &-items {
                    display: flex;
                    margin-top: 12px;
                    gap: 12px;
                    overflow: hidden;

                    & img {
                        width: 98px;
                        height: 98px;
                        border-radius: 20px;

                    }
                }
            }

            &-text {
                width: 100%;

                &-title {
                    font-weight: 700;
                    font-size: 28px;
                    color: var(--gray-900);
                }

                &-inclusive {
                    margin-top: 10px;
                }

                & p {
                    display: flex;
                    align-items: center;
                    gap: 10px;
                    margin-top: 12px;

                    & span {
                        font-weight: 700;
                        font-size: 16px;
                        color: var(--gray-500);
                    }
                }

                &-descr {
                    font-weight: 400;
                    font-size: 16px;
                    color: var(--gray-500);
                    margin-top: 10px;
                }

                &-price {
                    padding: 8px 16px;
                    background: var(--gray-100);
                    border-radius: 20px;
                    margin-top: 12px;
                    display: flex;
                    align-items: center;
                    justify-content: space-between;

                    & p {
                        font-weight: 700;
                        font-size: 36px;
                        color: var(--gray-900);
                        display: flex;
                        align-items: self-start;
                        flex-direction: column;

                        & span {
                            font-weight: 600;
                            font-size: 16px;
                            color: var(--gray-500);
                        }
                    }

                }
            }

        }
    }

    &__detail {
        &-header {
            &-options {
                display: flex;
                gap: 12px;

                &-item {
                    padding: 4px 10px;
                    display: flex;
                    align-items: center;
                    gap: 8px;
                    border-radius: 50px;
                    background: #cbedfb;

                    & span {
                        font-weight: 600;
                        font-size: 16px;
                        text-align: center;
                        color: var(--gray-900);
                    }

                    &:nth-child(2) {
                        background: var(--warning-200);

                        & span {
                            color: var(--warning-700);
                        }
                    }

                    &:nth-child(3) {
                        background: #cbd8fb;

                        & span {
                            color: #281ac8;
                        }
                    }
                }
            }

        }

        &-content {
            display: grid;
            grid-template-columns: repeat(2, 1fr);
            margin-top: 20px;
            gap: 40px;

            &-item {
                display: flex;
                flex-direction: column;
                justify-content: space-between;

                &-title {
                    font-weight: 700;
                    font-size: 36px;
                    color: var(--gray-900);
                }

                &:nth-child(2) {
                    display: flex;
                    flex-direction: column;
                    justify-content: space-between;
                }

                &-preview {
                    height: 400px;
                    border-radius: 50px;
                }

                &-gallery {
                    display: flex;
                    overflow: hidden;
                    gap: 12px;

                    & img {
                        width: 120px;
                        height: 120px;
                        border-radius: 20px;
                        object-fit: cover;
                    }
                }


                &-location {
                    display: flex;
                    align-items: center;
                    gap: 12px;
                    font-weight: 600;
                    font-size: 16px;
                    color: var(--gray-900);
                    margin: 20px 0;
                }

                &-overview {
                    display: flex;
                    flex-direction: column;
                    font-weight: 600;
                    font-size: 16px;
                    color: var(--gray-500);
                    max-width: 90%;
                    margin-bottom: 10px;

                    & span {
                        font-weight: 700;
                        font-size: 20px;
                        color: var(--gray-900);
                        margin-bottom: 20px;
                    }
                }

                &-options {
                    margin-bottom: 20px;

                    & span {
                        font-weight: 600;
                        font-size: 16px;
                        text-align: center;
                        color: var(--primary-900);
                        padding: 4px 10px;
                        border-radius: 10px;
                        background: var(--primary-300);
                    }
                }

                &-price {
                    display: flex;
                    justify-content: space-between;
                    align-items: center;
                    background: var(--white);
                    padding: 16px;
                    border-radius: 20px;

                    &-booking {
                        height: 69px;
                    }

                    &-block {
                        & span {
                            font-weight: 600;
                            font-size: 16px;
                            color: var(--gray-500);
                        }

                        & p {
                            font-weight: 800;
                            font-size: 48px;
                            text-transform: uppercase;
                            color: var(--gray-900);
                            margin-top: 8px;

                            & span {
                                font-weight: 700;
                                font-size: 20px;
                                color: var(--gray-900);
                            }
                        }
                    }
                }
            }


        }
    }
}
</style>